waveTransmissive/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15; //Water at 20C = 293.15K

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293.15;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    bottomWall
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    topWall
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    sphereWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //